personal-config.org
#+TITLE: Personal Configuration
#+PROPERTY: header-args :results silent

* Modules
** EXWM Window Manager
