modules/module-exwm.el

  (setq exwm-input-line-mode-passthrough t)

  (defun exwm-input-line-mode ()
    "Set exwm window to line-mode and show mode line"
    (call-interactively #'exwm-input-grab-keyboard)
    (exwm-layout-show-mode-line))

  (defun exwm-input-char-mode ()
    "Set exwm window to char-mode and hide mode line"
    (call-interactively #'exwm-input-release-keyboard)
    (exwm-layout-hide-mode-line))

  (defun exwm-input-toggle-mode ()
    "Toggle between line- and char-mode"
    (with-current-buffer (window-buffer)
      (when (eq major-mode 'exwm-mode)
        (if (equal (second (second mode-line-process)) "line")
            (exwm-input-char-mode)
          (exwm-input-line-mode)))))

  (defun exwm-input-set-global-key (key function)
    "Add KEY to `exwm-input-prefix-keys' and bind FUNCTION to KEY
          in exwm keymap"
    (cl-pushnew (elt key 0) exwm-input-prefix-keys)
    (exwm-input-set-key key function))

  (defun my/switch-to-last-buffer ()
    "Switch to last open buffer in current window."
    (interactive)
    (switch-to-buffer (other-buffer (current-buffer) 1)))

  (define-key minibuffer-inactive-mode-map [mouse-1] #'ignore)

  (push ?\s-  exwm-input-prefix-keys)

  (defvar exwm-input-prefix-keys-extra nil)


  (setq exwm-input-simulation-keys
        '(
          ;; movement
          ([?\C-b] . [left])
          ([?\C-f] . [right])
          ([?\C-p] . [up])
          ([?\C-n] . [down])
          ([?\C-a] . [home])
          ([?\C-e] . [end])
          ([?\M-v] . [prior])
          ([?\C-v] . [next])
          ([?\C-d] . [delete])
          ([?\C-k] . [S-end delete])

          ;; cut/paste
          ([?\C-w] . [?\C-x])
          ([?\M-w] . [?\C-c])
          ([?\C-y] . [?\C-v])
          ;; search
          ([?\C-s] . [?\C-f])))

  (defun my-exwm-keybindings ()
    "Add the key bindings for exwm."
    (exwm-input-set-key (kbd "<print>") #'desktop-environment-screenshot)

    ;; (exwm-input-set-key (kbd "C-SPC")
    ;;                     (lambda ()
    ;;                       (interactive)
    ;;                       (exwm-input-line-mode)
    ;;                       (hydra-master/body)))

    (exwm-input-set-key (kbd "C-SPC")
                        (lambda ()
                          (interactive)
                          (exwm-input-line-mode)
                          (modalka-mode-hydra)))

  (exwm-input-set-key (kbd "C-4")
                        (lambda ()
                          (interactive)
                          (exwm-input-line-mode)
                          (my/org-capture-appt)))
  (exwm-input-set-key (kbd "C-1")
                        (lambda ()
                          (interactive)
                          (exwm-input-line-mode)
                          (my/org-capture-task)))

  (exwm-input-set-key (kbd "C-2")
                        (lambda ()
                          (interactive)
                          (exwm-input-line-mode)
                          (my/org-capture-journal)))


  (exwm-input-set-key (kbd "C-3")
                        (lambda ()
                          (interactive)
                          (exwm-input-line-mode)
                          (my/org-capture-note)))


  (exwm-input-set-key (kbd "s-p")   'my/switch-to-last-buffer)
  (exwm-input-set-key (kbd "s-SPC") 'exwm-jump-to-last-exwm)
  (exwm-input-set-key (kbd "s-<tab>") 'ivy-switch-buffer-exwm)


    (exwm-input-set-key (kbd "s-f")   'toggle-single-window)

    (exwm-input-set-key (kbd "s-,")   'winner-undo)
    (exwm-input-set-key (kbd "s-.")   'winner-redo)

    (exwm-input-set-key (kbd "s-r") 'exwm-reset)
    (exwm-input-set-key (kbd "s-w") 'exwm-workspace-switch)

    (exwm-input-set-key (kbd "s-l") 'windmove-right)
    (exwm-input-set-key (kbd "s-k") 'windmove-left)
    (exwm-input-set-key (kbd "s-i") 'windmove-up)
    (exwm-input-set-key (kbd "s-o") 'windmove-down)


    (exwm-input-set-key (kbd "s-L") 'buf-move-right)
    (exwm-input-set-key (kbd "s-K") 'buf-move-left)
    (exwm-input-set-key (kbd "s-I") 'buf-move-up)
    (exwm-input-set-key (kbd "s-O") 'buf-move-down)

    (exwm-input-set-key (kbd "s-x") 'exwm-input-toggle-keyboard))

  (setq ibuffer-saved-filter-groups
        (quote (("default"
                 ("EXWM" (mode . exwm-mode))))))
                                          ;       ("org-mode" (mode . org-mode))
                                          ;       ("git" (mode . magit-status-mode))
                                          ;       ("dired" (mode . dired-mode))
                                          ;       ("emacs" (or
                                          ;                (name . "^\\*scratch\\*$")
                                          ;                (name . "^\\*Messages\\*$")
                                          ;                (name . "^\\*Bookmark List\\*$")
                                          ;                (name . "^\\*GNU Emacs\\*$")))))))

  (add-hook 'ibuffer-mode-hook
            (lambda ()
              (ibuffer-switch-to-saved-filter-groups "default")))


  (define-ibuffer-column size-h
    (:name "Size")
    (cond
     ((> (buffer-size) 1000000) (format "%7.1fM" (/ (buffer-size) 1000000.0)))
     ((> (buffer-size) 100000) (format "%7.0fk" (/ (buffer-size) 1000.0)))
     ((> (buffer-size) 1000) (format "%7.1fk" (/ (buffer-size) 1000.0)))
     (t (format "%8d" (buffer-size)))))

  (define-ibuffer-column exwm-class
    (:name "Class")
    (cond
     (exwm-class-name (format "%s" exwm-class-name))
     (t (format "%s" ""))))

  ;; Needs work to look good, major-mode is not equal to ibuffer-formats mode
  (define-ibuffer-column exwm-mode
    (:name "EXWM-Mode")
    (cond
     ((string-equal major-mode "exwm-mode") (format "%s" exwm-class-name))
     (t (format "%s" mode-name))))

  (setq ibuffer-formats
        '((mark modified read-only locked " "
                (name 50 50 :left :elide)
                " "
                (size-h 16 16 :right)
                " "
                (exwm-mode 18 18 :left :elide)
                " " filename-and-process)
          (mark modified read-only locked " "
                (name 50 50 :left :elide)
                " "
                (size-h 16 16 :right)
                " "
                (mode 18 18 :left :elide)
                (exwm-class 18 18 :left :elide)
                " " filename-and-process)
          (mark " "
                (name 16 -1)
                " " filename)))

  (defun my-counsel-ibuffer-by-exwm-class-name ()
    "`counsel-ibuffer' limited to Exwm buffers of same X class."
    (interactive)
    (require 'ibuffer)
    (cl-letf*
        ((class-name exwm-class-name)
         (get-buffers-function
          (symbol-function 'counsel-ibuffer--get-buffers))
         ((symbol-function 'counsel-ibuffer--get-buffers)
          (lambda ()
            (--filter (with-current-buffer (cdr it)
                        (and (eq major-mode 'exwm-mode)
                             (string-equal exwm-class-name class-name)))
                      (funcall get-buffers-function)))))
      (counsel-ibuffer)))
