modules/module-exwm.el

  (defvar exwm-connected-displays 3
    "Number of connected displays.")

  ;; Update exwm-randr-workspace-output-plist with 2 or 3 outputs named
  ;; 'primary' and 'other-1'/'other-2'.
  ;; With 3 outputs connected the first workspace will be primary,
  ;; second workspace goes to 'other-2' and all others to 'other-1'.
  ;; With 2 outputs, first workspace is 'primary' display and rest 'other-1'.
  ;; And with only one connected output, primary has all workspaces.
  (defun my/exwm-randr-screen-change ()
    (let* ((connected-cmd "xrandr -q|awk '/ connected/ {print $1}'")
           (connected (process-lines "bash" "-lc" connected-cmd))
           (primary (car connected))  ; Primary display is always first in list
           (other-1 (cadr connected))
           (other-2 (caddr connected)))
      (setq exwm-connected-displays (length connected))
      (setq exwm-randr-workspace-monitor-plist
            (append (list 0 primary)
                    (list 1 (or other-2 other-1 primary))
                    (mapcan (lambda (i) (list i (or other-1 other-2 primary)))
                            (number-sequence 2 exwm-workspace-number))))
      (exwm-randr-refresh)
      (message "Randr: %s monitors refreshed." (string-join connected ", "))))

  (add-hook 'exwm-randr-screen-change-hook #'my/exwm-randr-screen-change)

  (defun app/autostart (application)
    "Add an application to autostart."
    (add-hook 'exwm-init-hook
              `(lambda ()
                 (start-process-shell-command "autostart-process" nil ,application))))

  (defun my-exwm-autostart ()
    "Add applications that will be loaded after exwm init is done."
    (mapcar (lambda (program) (app/autostart program)) exwm-autostart))


  (setq exwm-autostart
        (list
;         "thinkpad-dock off"
;         "compton -b"
;         "thinkpad-touchpad off"
;         "/usr/lib/polkit-gnome/polkit-gnome-authentication-agent-1"
;         "/usr/lib/gpaste/gpaste-daemon"
;         "pamac-tray"
;         "redshift-gtk"
;         "kdeconnect-indicator"
;         "autorandr --change"
;         "thinkpad-dock on"
         ))


  (add-hook 'after-init-hook
            (lambda ()
              (exwm-randr-enable)
;              (exwm-systemtray-enable)
              (exwm-input--update-global-prefix-keys)
              (my-exwm-keybindings)
;             (my-exwm-autostart)
;              (my-exwm-workspaces)
              (exwm-enable)
              t)))
