modules/module-hydra.el
(defhydra hydra-common  (:color blue
                                :hint nil)
  ("RET"   counsel-linux-app nil)
  ("SPC"   counsel-M-x nil)

  ("Q" kill-this-buffer nil)

  ("<tab>" ivy-switch-buffer-non-exwm)
  ("s-<tab>"  ivy-switch-buffer-exwm)

  ("@"   org-capture nil)
  ("W"   hydra-window/body nil)

  ("0" delete-window-balance)
  ("1" delete-other-windows)
  ("2" split-window-below)
  ("3" split-window-right)

  (";" ace-swap-window)
  ("#" hycontrol-windows-grid))

(defhydra hydra-master (
                        :color blue
                        :column 1
                        :inherit (hydra-common/heads))
  "Master"
  ("a" hydra-applications/body "apps")
  ("b" hydra-bookmarks/body "bookmarks")
  ("c" quick-calc "calc")
  ("e" hydra-emacs/body "emacs")
  ("f" hydra-file/body "file")
  ("l" hydra-spell/body "spell")
  ("m" boon-mode-hydra "major")
  ("M" hydra-minor/body nil)
  ("p" hydra-projects/body "projects")
  ("s" hydra-search/body "search")
  ("t" hydra-terminal/body "term")
  ("x" hydra-text/body "text"))

(defhydra hydra-emacs (:color blue :hint nil :inherit (hydra-common/heads))

  "
                                                                         ╭───────┐
     Execute       Packages         Help                     Misc        │ Emacs │
  ╭──────────────────────────────────────────────────────────────────────┴───────╯
    [_x_] counsel M-x [_p_] list      [_f_] describe function [_t_] change theme
    [_e_] exit        [_i_] install   [_v_] describe variable [_l_] list emacs process
    [_s_] system      [_u_] upgrade   [_m_] info manual       [_c_] init time
     ^ ^               ^ ^            [_k_] bindings          [_o_] unbound commands
     ^ ^               ^ ^            [_b_] personal bindings [_y_] emacs colors
     ^ ^               ^ ^             ^ ^                    [_z_] list faces
     ^ ^               ^ ^             ^ ^
  --------------------------------------------------------------------------------
        "
  ("C-h b" counsel-descbinds "bindings")
  ("f" counsel-describe-function)
  ("v" counsel-describe-variable)
  ("b" describe-personal-keybindings)
  ("c" emacs-init-time)
  ("i" package-install)
  ("k" counsel-descbinds)
  ("l" list-processes)
  ("m" info-display-manual)
  ("p" paradox-list-packages)
  ("t" counsel-load-theme)
  ("u" paradox-upgrade-packages)
  ("o" smex-show-unbound-commands)
  ("y" counsel-colors-emacs)
  ("z" counsel-faces)
  ("x" counsel-M-x)
  ("e" save-buffers-kill-emacs)
  ("s" hydra-system/body nil)
  )

(defhydra hydra-terminal (:color blue :hint nil :inherit (hydra-common/heads))

  "
                                                                        ╭──────────┐
     Terminals                     System                               │ Terminal │
  ╭─────────────────────────────────────────────────────────────────────┴──────────╯
    [_s_] new multi-term           [_c_] shell command
    [_n_] next multi-term          [_a_] aync shell command
    [_p_] previous multi-term      [_m_] man page
    [_d_] dedicated multi-term     [_l_] list system process
    [_e_] eshell
  --------------------------------------------------------------------------------
        "
  ("a" async-shell-command)
  ("c" shell-command)
  ("e" eshell)
  ("m" man)
  ("l" proced)
  ("s" multi-term)
  ("n" multi-term-next)
  ("p" multi-term-previous)
  ("d" multi-term-dedicated-toggle))

(defhydra hydra-file (:color blue :hint nil :inherit (hydra-common/heads))

  "
                                                                          ╭──────┐
       Ivy                    Dired            Hydras                     │ File │
  ╭───────────────────────────────────────────────────────────────────────┴──────╯
    [_f_] open file            [_d_] dired     [_ht_] text
    [_e_] open file extern                   [_hs_] spell
    [_r_] open recentf

  --------------------------------------------------------------------------------
        "
  ("f" counsel-find-file)
  ("e" counsel-find-file-extern)
  ("r" counsel-recentf "recent")
  ("d" dired-jump)
  ("hs" hydra-spell/body nil  :color blue)
  ("ht" hydra-text/body nil   :color blue)
  )
