personal-config.org
*** hydra-narrow
    #+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/modules/module-hydra.el
(defhydra hydra-narrow (:color blue :hint nil :inherit (hydra-common/heads))

  "
                                                                        ╭────────┐
      Narrow                                                            │ Narrow │
  ╭─────────────────────────────────────────────────────────────────────┴────────╯
    [_f_] narrow to defun
    [_p_] narrow to page
    [_s_] narrow to subtree
    [_r_] narrow to region

    [_w_] widen
  --------------------------------------------------------------------------------
        "
  ("f" narrow-to-defun)
  ("p" narrow-to-page)
  ("s" org-narrow-to-subtree)
  ("c" org-narrow-to-block)
  ("r" narrow-to-region)
  ("w" widen))
    #+END_SRC
*** hydra-spell
    #+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/modules/module-hydra.el
(defhydra hydra-spell (:color blue :hint nil :inherit (hydra-common/heads))

  "
                                                                         ╭───────┐
      Flyspell               Ispell                      Gtranslate      │ Spell │
  ╭──────────────────────────────────────────────────────────────────────┴───────╯
    [_k_] correct word       [_w_] check word            [_g_] en ⇆ es
    [_n_] next error                                   [_G_] any lang
    [_f_] toggle flyspell
    [_p_] toggle prog mode
  --------------------------------------------------------------------------------
        "
  ("w" ispell-word)
  ("d" ispell-change-dictionary)
  ("g" google-translate-smooth-translate)
  ("G" google-translate-query-translate)
  ("f" flyspell-mode)
  ("p" flyspell-prog-mode)
  ("k" flyspell-correct-word-generic)
  ("n" flyspell-goto-next-error))
    #+END_SRC

*** hydra-text
    #+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/modules/module-hydra.el
(defhydra hydra-text (:color blue :hint nil :inherit (hydra-common/heads))


  "
                                                                               ╭──────┐
        Size  Toggle              Unicode                        Do            │ Text │
       ╭───────────────────────────────────────────────────────────────────────┴──────╯
         _k_  [_f_] fill column     [_d_] unicode character           [_a_] align with regex
         ^↑^  [_h_] hidden chars    [_e_] evil digraphs table         [_w_] remove trailing ' '
         ^ ^  [_l_] line numbers    [_s_] specific code block         [_n_] count words
         ^↓^  [_t_] trailing ' '    [_u_] unicode character           [_i_] lorem ipsum
         _j_  [_v_] font space      [_p_] character code              [_x_] comment box
         ^ ^  [_c_] comment          ^ ^                              [_q_] boxquote
         ^ ^  [_b_] multibyte chars  ^ ^                              [_m_] iedit (multiple)
         ^ ^   ^ ^                   ^ ^                              [_r_] expand region
         ^ ^   ^ ^                   ^ ^                              [_U_] tabs to spaces
       --------------------------------------------------------------------------------
             "
  ("a" align-regexp)
  ("b" toggle-enable-multibyte-characters)
  ("c" comment-line)
  ("d" insert-char)
  ("e" evil-ex-show-digraphs)
  ("f" fci-mode)
  ("h" whitespace-mode)
  ("i" lorem-ipsum-insert-paragraphs)
  ("k" text-scale-increase :color red)
  ("j" text-scale-decrease :color red)
  ("l" linum-mode)
  ("n" count-words)
  ("m" iedit)
  ("p" describe-char)
  ("r" er/expand-region)
  ("s" charmap)
  ("t" joe-toggle-show-trailing-whitespace)
  ("u" counsel-unicode-char)
  ("v" variable-pitch-mode)
  ("w" whitespace-cleanup)
  ("U" untabify)
  ("q" hydra-boxquote/body)
  ("x" comment-box))
    #+END_SRC

*** hydra-git
    :PROPERTIES:
    :CREATED:  [2019-06-20 Thu 17:11]
    :END:
    #+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/modules/module-hydra.el
(defhydra hydra-git (:color blue :hint nil :inherit (hydra-common/heads))

  "
                                                                           ╭─────┐
     Magit                          VC                    Timemachine      │ Git │
  ╭────────────────────────────────────────────────────────────────────────┴─────╯
    [_s_] status              [_d_] diffs between revisions  [_t_] timemachine
    [_B_] blame mode          [_b_] edition history
    [_l_] file log
  --------------------------------------------------------------------------------
        "
  ("B" magit-blame)
  ("b" vc-annotate)
  ("d" vc-diff)
  ("l" magit-log-buffer-file)
  ("s" magit-status)
  ("t" git-timemachine))
    #+END_SRC

*** hydra-window
    :PROPERTIES:
    :CREATED:  [2019-06-20 Thu 17:12]
    :END:
    #+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/modules/module-hydra.el
(defhydra hydra-window (
                        :color red
                        :hint  nil
                        :inherit (hydra-common/heads))
  "
                                                                       ╭──────────┐
    Window         Switch           View                               │  Window  │
  ╭────────────────────────────────────────────────────────────────────┴──────────╯
       ↑          [_b_] ibuffer     [_s_] save
       _i_          [_p_] projectile  [_d_] delete
   ← _k_   _l_ →      [_e_] exwm        [_v_] view
       _o_
       ↓

     ^ ^
  --------------------------------------------------------------------------------
      "
  ("i" windmove-up)
  ("o" windmove-down)
  ("k" windmove-left)
  ("l" windmove-right)

  ("I" buf-move-up)
  ("O" buf-move-down)
  ("K" buf-move-left)
  ("L" buf-move-right)

  ("b" ibuffer)
  ("p" counsel-projectile-switch-to-buffer)
  ("e" ivy-switch-buffer-exwm)

  ("s"  ivy-push-view)
  ("d"  ivy-pop-view)
  ("v"  ivy-switch-view)

  ("0" delete-window-balance)
  ("1" delete-other-windows)
  ("2" split-window-below)
  ("3" split-window-right)

  (";" ace-swap-window "swap")
  ("@" hycontrol-windows-grid)
  )
    #+END_SRC

*** hydra-jump
    :PROPERTIES:
    :CREATED:  [2019-06-20 Thu 17:12]
    :END:
    #+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/modules/module-hydra.el
(defhydra hydra-jump (:color blue :hint nil :inherit (hydra-common/heads))

  "
                                                                          ╭──────┐
    Window          WordChar        Line         iSearch                  │ Jump │
  ╭───────────────────────────────────────────────────────────────────────┴──────╯
    [_w_] jump        [_j_] word         [_l_] jump     [_i_] jump
    [_d_] close       [_p_] all words    [_y_] copy
    [_z_] maximize    [_b_] subword      [_m_] move
    [_s_] swap        [_c_] char         [_v_] copy region
     ^ ^              [_a_] two chars
  --------------------------------------------------------------------------------
        "
  ("w" ace-window)
  ("d" ace-delete-window)
  ("z" ace-maximize-window)
  ("s" ace-swap-window)
  ("j" avy-goto-word-1)
  ("p" avy-goto-word-0)
  ("b" avy-goto-subword-0)
  ("c" avy-goto-char)
  ("a" avy-goto-char-2)
  ("l" avy-goto-line)
  ("y" avy-copy-line)
  ("m" avy-move-line)
  ("v" avy-copy-region)
  ("i" avy-isearch)
  )
    #+END_SRC
*** hydra-register
    #+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/modules/module-hydra.el
(defhydra hydra-register (:color blue :hint nil :inherit (hydra-common/heads))


  "
                                                                          ╭──────────┐
         Logs                        Registers                Undo        │ Register │
      ╭───────────────────────────────────────────────────────────────────┴──────────╯
        [_c_] commands history       [^e^] registers        [_u_] undo tree
        [_o_] messages
        [_l_] lossage (keystrokes)
        [_d_] diff buffer with file
      --------------------------------------------------------------------------------
            "
  ("d" joe-diff-buffer-with-file)
  ("k" counsel-yank-pop)
  ("l" view-lossage)
  ("c" counsel-command-history)
  ("m" evil-show-marks)
  ("o" view-echo-area-messages)
  ("r" evil-show-registers)
  ("u" undo-tree-visualize))
    #+END_SRC

