modules/module-hydra.el
         Files                             Buffer                           │ Search │
      ╭─────────────────────────────────────────────────────────────────────┴────────╯
        [_a_] regex search (Ag)           [_b_] by word
        [_r_] regex search (rg)           [_o_] by word (opened buffers)
        [_p_] regex search (pt)           [_w_] by word (multi)
        [_g_] regex search (grep)         [_h_] by word (grep or swiper)
        [^f^] find                        [_t_] tags & titles
        [_l_] locate                      [_s_] semantic
      --------------------------------------------------------------------------------
            "
  ("a" (let ((current-prefix-arg "-."))
         (call-interactively 'counsel-ag)))
  ("r" (let ((current-prefix-arg "-."))
         (call-interactively 'counsel-rg)))
  ("p" (let ((current-prefix-arg "-."))
         (call-interactively 'counsel-pt)))
  ("g" rgrep)
  ("l" counsel-locate)
  ("b" swiper)
  ("o" swiper-all)
  ("h" counsel-grep-or-swiper)
  ("t" counsel-imenu)
  ("s" counsel-semantic)
  ("w" swiper-multi))

(defhydra hydra-bookmarks (
                           :color red
                           :hint nil
                           :inherit (hydra-common/heads))

  "
                                                                     ╭───────────┐
         List                          Do                            │ Bookmarks │
  ╭──────────────────────────────────────────────────────────────────┴───────────╯
    [_l_] list bookmarks            [_j_] jump to a bookmark
     ^ ^                            [_m_] set bookmark at point
     ^ ^                            [_s_] save bookmarks
  --------------------------------------------------------------------------------
      "
  ("l" counsel-bookmark)
  ("j" bookmark-jump)
  ("m" bookmark-set)
  ("s" bookmark-save))

(defhydra hydra-help (:exit t :columns 4)
  "Help"
  ("f" counsel-apropos "Function search")
  ("k" view-lossage "View Keystrokes")
  ("c" find-function "Function code")
  ("P" esup "Profile")
  ("h" helpful-at-point "Help at point")
  ("p" find-function-at-point "Function at Point")
  ("l" find-library "Library source"))

(defhydra hydra-projects (:color blue :hint nil :inherit (hydra-common/heads))
  "
                                                                       ╭────────────┐
       Files             Search          Buffer             Do         │ Projectile │
     ╭─────────────────────────────────────────────────────────────────┴────────────╯
       [_f_] file          [_sa_] ag          [_b_] switch         [_g_] magit
       [_l_] file dwim     [_sr_] rg          [_v_] show all       [_p_] switch
       [_r_] recent file   [_so_] occur       [_V_] ibuffer        [_P_] commander
       [_d_] dir           [_sR_] replace     [_K_] kill all       [_i_] info
       [_o_] other         [_st_] find tag
       [_u_] test file     [_sT_] make tags
                                                                           ╭────────┐
       Other Window      Run             Cache              Do             │ Fixmee │
     ╭──────────────────────────────────────────────────╯ ╭────────────────┴────────╯
       [_F_] file          [_U_] test        [_kc_] clear         [_x_] TODO & FIXME
       [_L_] dwim          [_m_] compile     [_kk_] add current   [_X_] toggle
       [_D_] dir           [_c_] shell       [_ks_] cleanup
       [_O_] other         [_C_] command     [_kd_] remove
       [_B_] buffer
     --------------------------------------------------------------------------------
           "

  ("p"   projectile-switch-project)
  ("sa"  counsel-projectile-ag)
  ("sr"  counsel-projectile-rg)
  ("b"   counsel-projectile-switch-to-buffer)
  ("B"   counsel-projectile-switch-to-buffer-other-window)
  ("d"   counsel-projectile-find-dir)
  ("D"   counsel-projectile-find-dir-other-window)
  ("f"   counsel-projectile-find-file)
  ("F"   counsel-projectile-find-file-other-window)
  ("l"   counsel-projectile-find-file-dwim)
  ("L"   counsel-projectile-find-file-dwim-other-window)

  ("c"   projectile-run-async-shell-command-in-root)
  ("C"   projectile-run-command-in-root)
  ("g"   hydra-git/body nil)
  ("i"   projectile-project-info)
  ("kc"  projectile-invalidate-cache)
  ("kd"  projectile-remove-known-project)
  ("kk"  projectile-cache-current-file)
  ("K"   projectile-kill-buffers)
  ("ks"  projectile-cleanup-known-projects)
  ("m"   projectile-compile-project)
  ("o"   projectile-find-other-file)
  ("O"   projectile-find-other-file-other-window)
  ("P"   projectile-commander)
  ("r"   projectile-recentf)
  ("so"   projectile-multi-occur)
  ("sR"   projectile-replace)
  ("st"   projectile-find-tag)
  ("sT"   projectile-regenerate-tags)
  ("u"   projectile-find-test-file)
  ("U"   projectile-test-project)
  ("v"   projectile-display-buffer)
  ("V"   projectile-ibuffer)

  ("X"   fixmee-mode)
  ("x"   fixmee-view-listing))

(define-key projectile-mode-map (kbd "C-c o") #'hydra-project/body)

(defhydra hydra-torus (:color red :hint nil :inherit (hydra-common/heads))

  "
                                                                                             ╭─────────┐
      Switch                    Move                        Do                               │  Torus  │
  ╭──────────────────────────────────────────────────────────────────────────────────────────┴─────────╯
    [_c_] circle          [_<up>_]  prev-location         [_#_]  layout            [_s_] search
    [_l_] location        [_<down>_] next-location        [_ac_] add-circle        [_h_] search-history
    [_t_] torus                                         [_al_] add-location      [_m_] meta-history
                        [_<left>_]  prev-circle         [_at_] add-torus
                        [_<right>_] next-circle
                                                      [_dc_] delete-circle
                                                      [_dl_] delete-location
                        [_<prior>_] newer-history       [_dt_] delete-torus
                        [_<next>_]  older-history
     ^ ^
  -------------------------------------------------------------------------------------------------------
      "

  ("#" torus-layout-menu :color blue)

  ("c" torus-switch-circle :color blue)
  ("l" torus-switch-location :color blue)
  ("t" torus-switch-torus :color blue)

  ("ac" torus-add-circle :color blue)
  ("al" torus-add-location :color blue)
  ("at" torus-add-torus :color blue)

  ("dl" torus-delete-location :color blue)
  ("dc" torus-delete-circle :color blue)
  ("dt" torus-delete-torus :color blue)

  ("<up>"   torus-previous-location)
  ("<down>" torus-next-location)
  ("<left>" torus-previous-circle)
  ("<right>" torus-next-circle)


  ("s" torus-search :color blue)
  ("h" torus-search-history :color blue)
  ("m" torus-search-meta-history :color blue)

  ("<prior>" torus-history-newer)
  ("<next>" torus-history-older)

  )

(defhydra hydra-applications (:exit t :columns 4)
  "Applications"
  ("p" counsel-list-processes "Show Processes")
  ("r" elfeed "RSS Feeds"))
