personal-config.org
*** hydra-org-refiler
    #+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/modules/module-hydra.el
(defvar org-default-projects-dir   "~/org/projects/"                     "Primary GTD directory")
(defvar org-default-notes-dir "~/org/notes/"                     "Directory of notes modeled after Zettelkasten includes an Archive, and Notes")
(defvar org-default-completed-dir  "~/org/projects/completed"            "Directory of completed project files")
(defvar org-default-inbox-file     "~/org/agenda/inbox.org"         "New stuff collects in this file")
(defvar org-default-tasks-file     "~/org/agenda/tasks.org"           "Tasks, TODOs and little projects")
(defvar org-default-incubate-file  "~/org/agenda/incubate.org"        "Ideas simmering on back burner")
(defvar org-default-calendar-file  "~/org/agenda/calendar.org"        "Ideas simmering on back burner")
(defvar org-default-delegate-file  "~/org/agenda/delegate.org"        "Ideas simmering on back burner")
(defvar org-default-waiting-file  "~/org/agenda/waiting.org"        "Ideas simmering on back burner")
(defvar org-default-completed-file nil                              "Ideas simmering on back burner")
(defvar org-default-notes-file     "~/org/agenda/inbox.org"   "Non-actionable, personal notes")

(defhydra hydra-org-refiler (:hint nil)
  "
     ^Update^        ^Refile^         ^Calendar^        ^Ref^         ^Move^           ^Go To^
     ^^^^^^^^^^------------------------------------------------------------------------------------------
     _t_: todo      _T_: tasks      _c c_: calendar  _r d_: web      _m p_: projects   _g p_: projects
     _s_: schedule  _I_: incubate   _c t_: tickler   _r w_: docs     _m n_: notes      _g c_: completed
     _d_: deadline  _W_: waiting    _c d_: delegate  _r i_: images
     _h_: headline  _R_: refile


     "
  ("<up>" org-previous-visible-heading)
  ("<down>" org-next-visible-heading)
  ("k" org-previous-visible-heading)
  ("j" org-next-visible-heading)

  ("T" org-refile-to-task)
  ("I" org-refile-to-incubate)
  ("W" org-refile-to-waiting)
  ("R"  org-refile)

  ("c c" refile-to-calendar)
  ("c t" refile-to-tickler)
  ("c d" org-refile-to-delegate)

  ("r d" note-to-documents)
  ("r w" note-to-websites)
  ("r i" note-to-images)

  ("m p" org-refile-to-projects-dir)
  ("m n" org-refile-to-notes-dir)

  ("t" org-todo)
  ("s" org-schedule)
  ("d" org-deadline)
  ("h" org-rename-header)

  ("g p" (dired org-default-projects-dir))
  ("g c" (dired org-default-completed-dir))
  ("[\t]" (org-cyce))

  ("s" (org-save-all-org-buffers) "save")

  ("a" org-archive-subtree "archive")
  ("d" org-cut-subtree "delete")
  ("q" (my/switch-to-last-buffer) "quit" :color blue))

    #+END_SRC

    #+results:
    : hydra-org-refiler/body
*** hydra-minor modes
    #+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/modules/module-hydra.el
(defhydra hydra-minor (:exit t :columns 4)
  "Minor modes"
  ("r" spray-mode "Speed read")
  ("n" em/narrow-or-widen-dwim "Narrow / Widen")
  ("i" iedit-mode "Iedit mode"))
    #+END_SRC
*** hydra-python
    #+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/modules/module-hydra.el
(with-no-warnings
  (defhydra hydra-python (:exit t :columns 4
                                :inherit (hydra-common/heads))
    "Python"
    ("#" poporg-dwim "Edit Comment")
    ("," dumb-jump-back "Jump back")
    ("." dumb-jump-go "Jump to definition")
    ("D" hydra-python-django/body "Django")
    ("L" flycheck-prev-error "Prev lint error")
    ("T" pythonic-tests-all "Run pythonic test")
    ("a" pytest-all "Run all tests")
    ("b" python-shell-send-buffer "Send buffer to python")
    ("u" em-python-pur "Upgrade pip requirements")
    ;;("r" python-shell-send-buffer "Send line/region to python")
    ("r" run-python "REPL")
                                        ;    ("d" helm-dash-at-point "Docs")
    ("c" em-python-execute "Compile / Execute")
    ("i" dumb-jump-quick-look "Definition Info")
    ("l" flycheck-next-error "Next lint error")
    ("t" pythonic-tests-run "Run current test")
    ("V" flycheck-verify-setup "Verify linting")
    ("v" em-python-environment "Check environment")
    ("s" isortify-buffer "Sort imports")
    ;;("n" flyceck "Run all tests")
    ("f" blacken-buffer "Format buffer code")))
    #+END_SRC

*** hydra-exwm
    #+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/modules/module-hydra.el
(defhydra hydra-exwm (:exit t
                            :columns 2
                            :color blue
                            :inherit (hydra-common/heads))

  "EXWM"
  ("0" delete-window "delete")

  ("s"  #'exwm-input-send-next-key "send key")

  ("1" ace-delete-window "other")

  ("t"  #'exwm-floating-toggle-floating "toggle floating")

  ("2" split-window-below "below")

  ("f"  #'exwm-layout-set-fullscreen "fullscreen")

  ("3" split-window-right "right")

  ("m"  #'exwm-workspace-move-window "move window")

  (";" ace-swap-window "swap")

  ("r" rename-buffer "rename")

  ("e" exwm-edit--compose "compose")

  ("g" hycontrol-windows-grid "grid"))

    #+END_SRC
