personal-config.org
*** hydra-windows-hydra
    #+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/modules/module-hydra.el
(defhydra windows-hydra ()
  "Window Management"
  ("a" (call-interactively #'ace-window) "ace")
  ("v" (flip-frame) "flip-vertically")
  ("h" (flop-frame) "flop-horizontally")
  ("r" (rotate-frame-clockwise) "rotate clockwise")
  ("R" (rotate-frame-anticlockwise) "rotate anti-clockwise")
  ("t" (transpose-frame) "transpose")
  ("w" (call-interactively #'exwm-workspace-move-window) "exwm move win to workspace")
  ("<left>" (call-interactively #'shrink-window-horizontally) "shrink-window-horizontally")
  ("<right>" (call-interactively #'enlarge-window-horizontally) "enlarge-window-horizontally")
  ("<down>" (call-interactively #'shrink-window) "shrink-window")
  ("<up>" (call-interactively #'enlarge-window) "enlarge-window")
  ("<s-up>" (windmove-up) "move up")
  ("<s-down>" (windmove-down) "move down")
  ("<s-right>" (windmove-right) "move right")
  ("<s-left>" (windmove-left) "move left")
  ("0" (delete-window) "")
  ("s-0" (delete-window) "")
  ("1" (delete-other-windows) "")
  ("s-1" (delete-other-windows) "")
  ("2" (split-window-below) "")
  ("s-2" (split-window-below) "")
  ("3" (split-window-right) "")
  ("s-3" (split-window-right) "")
  ("q" nil "Quit"))

    #+END_SRC

    #+results:
    : windows-hydra/body

*** hydra-caps-hydra
    #+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/modules/module-hydra.el
(defhydra hydra-caps (:exit nil)
  "NAVI-MODE"
  ("<menu>" nil)

  ("=" ((lambda ()
          (start-process-shell-command "notify-send" nil "notify-send Smarparens-Strict-Mode Toggled")
          (call-interactively #'smartparens-strict-mode))))

  ("C-g" (keyboard-quit))
  ("g" (keyboard-quit))
  ("SPC" (call-interactively #'set-mark-command))
  ("C-SPC" (call-interactively #'set-mark-command))
  ("C-n" (next-line))
  (";" (call-interactively #'goto-last-change))
  ("," (call-interactively #'goto-last-change-reverse))
  ("C-p" (previous-line))
  ("C-f" (forward-char))
  ("C-b" (backward-char))
  ("C-v" (scroll-up-command))
  ("v" (scroll-up-command))
  ("M-v" (scroll-down-command))
  ("V" (scroll-down-command))

  ("j" (dumb-jump-go))
  ("k" (dumb-jump-back))
  ("l" (dumb-jump-quick-look))

  ("<" (beginning-of-buffer))
  (">" (end-of-buffer))
  ("\[" (backward-paragraph))
  ("\]" (forward-paragraph))
  ("s-f" (sp-forward-symbol))
  ("M-f" (forward-word))
  ("s-b" (sp-backward-symbol))
  ("M-b" (backward-word))

  ("e" (sp-forward-sexp))
  ("a" (sp-backward-sexp))
  ("f" (sp-down-sexp))
  ("b" (sp-up-sexp))
  ("m" (call-interactively #'magit-status))
  ("n" (sp-next-sexp))
  ("p" (sp-previous-sexp))
  ("s" (sp-select-next-thing))
  ("S" (sp-select-previous-thing))

  ("B" (helm-buffers-list))
  ("E" ((lambda ()
          (flycheck-mode 1)
          (flycheck-list-errors))))
  ("P" (projectile-commander))
  ("F" (call-interactively #'helm-find-files))
  ("D" (dired (helm-current-directory)))
  ("M" (call-interactively #'magit-status))

  ("/" (helm-swoop))
  ("+" (operate-on-number-at-point)))

    #+END_SRC

    #+results:
    : caps-hydra/body

*** hydra-undo-tree
    #+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/modules/module-hydra.el
(defhydra hydra-undo-tree (:color yellow
                                  :hint nil
                                  )
  "
    _p_: undo  _n_: redo _s_: save _l_: load   "
  ("p"   undo-tree-undo)
  ("n"   undo-tree-redo)
  ("s"   undo-tree-save-history)
  ("l"   undo-tree-load-history)
  ("u"   undo-tree-visualize "visualize" :color blue)
  ("q"   nil "quit" :color blue))

    #+END_SRC

    #+results:
    : hydra-undo-tree/body

*** hydra-pdftools
    #+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/modules/module-hydra.el
(defhydra hydra-pdftools (:color blue :hint nil)
  "
                                                                        ╭───────────┐
         Move  History   Scale/Fit     Annotations  Search/Link    Do   │ PDF Tools │
     ╭──────────────────────────────────────────────────────────────────┴───────────╯
        ^^^_g_^^^       _B_    ^↧^    _+_    ^ ^     [_al_] list    [_s_] search      [_u_] revert buffer
        ^^^^↑^^^^       ^↑^    _H_    ^↑^  ↦ _W_ ↤   [_am_] markup  [_o_] outline     [_i_] info
        ^^^_p_^^^       ^ ^    ^↥^    _0_    ^ ^     [_at_] text    [_F_] link        [_d_] midgnight mode
        ^^^^↑^^^^       ^↓^  ╭─^─^─┐  ^↓^  ╭─^ ^─┐   [_ad_] delete  [_f_] search link [_D_] print mode
   _h_ ← _e_/_t_ → _l_  _N_  │ _P_ │  _-_    _b_     [_aa_] dired
        ^^^^↓^^^^       ^ ^  ╰─^─^─╯  ^ ^  ╰─^ ^─╯   [_y_]  yank
        ^^^_n_^^^       ^ ^  _r_eset slice box
        ^^^^↓^^^^
        ^^^_G_^^^
     --------------------------------------------------------------------------------
          "
  ("\\" hydra-master/body "back")
  ("<ESC>" nil "quit")
  ("al" pdf-annot-list-annotations)
  ("ad" pdf-annot-delete)
  ("aa" pdf-annot-attachment-dired)
  ("am" pdf-annot-add-markup-annotation)
  ("at" pdf-annot-add-text-annotation)
  ("y"  pdf-view-kill-ring-save)
  ("+" pdf-view-enlarge :color red)
  ("-" pdf-view-shrink :color red)
  ("0" pdf-view-scale-reset)
  ("H" pdf-view-fit-height-to-window)
  ("W" pdf-view-fit-width-to-window)
  ("P" pdf-view-fit-page-to-window)
  ("n" pdf-view-next-page-command :color red)
  ("p" pdf-view-previous-page-command :color red)
  ("d" pdf-view-midnight-minor-mode)
  ("D" pdf-view-printer-minor-mode)
  ("b" pdf-view-set-slice-from-bounding-box)
  ("r" pdf-view-reset-slice)
  ("g" pdf-view-first-page)
  ("G" pdf-view-last-page)
  ("e" pdf-view-goto-page)
  ("t" pdf-view-goto-label)
  ("o" pdf-outline)
  ("s" pdf-occur)
  ("i" pdf-misc-display-metadata)
  ("u" pdf-view-revert-buffer)
  ("F" pdf-links-action-perfom)
  ("f" pdf-links-isearch-link)
  ("B" pdf-history-backward :color red)
  ("N" pdf-history-forward :color red)
  ("l" image-forward-hscroll :color red)
  ("h" image-backward-hscroll :color red))
    #+END_SRC

    #+results:
    : hydra-pdftools/body
** transient
   :PROPERTIES:
   :CREATED:  [2019-06-28 Fri 15:54]
   :END:
   :LOGBOOK:
   - CLOSING NOTE [2019-06-28 Fri 15:54]
   :END:
   #+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/modules/module-transient.el
(use-package transient
  :config
  (add-to-list 'load-path "~/Public/matcha")
  (load-file "~/Public/matcha/matcha.el")
  (matcha-setup))
   #+END_SRC
*** org-agenda-process
   #+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/modules/module-transient.el
(require 'matcha-base)
(require 'org)

(define-transient-command org-agenda-process ()
  "Agenda"

  [["Move"
   ("n" "Next" org-next-visible-heading :transient t)
   ("p" "Prev" org-previous-visible-heading :transient t)]

   ["Update"
    ("t" "Todo" org-todo :transient t)
    ("s" "Schedule" org-schedule :transient t)
    ("d" "Deadline" org-deadline :transient t)
    ("h" "Rename" org-rename-header :transient t)
    ("a" "Archive" org-archive-subtree :transient t)
    ("d" "Delete" org-cut-subtree :transient t)
    ("S" "Save.." org-save-all-org-buffers :transient t)]

   ["Create"
    ("P" "Project" org-refile-to-projects-dir :transient t)
    ("N" "Note" org-refile-to-notes-dir :transient t)]

   ["Refile to"
    ("T" "Tasks" org-refile-to-task :transient t)
    ("I" "Incubate" org-refile-to-incubate :transient t)
    ("W" "Waiting" org-refile-to-waiting :transient t)
    ("R" "Other.." org-refile :transient t)]

   ["Calendar"
    ("c c" "Calendar" refile-to-calendar :transient t)
    ("c t" "Tickler" refile-to-tickler :transient t)
    ("c d" "Delegate" org-refile-to-delegate :transient t)]

   ["Reference"
    ("r d" "Document" note-to-documents :transient t)
    ("r w" "Website" note-to-websites :transient t)
    ("r i" "Images" note-to-images :transient t)]])




    #+END_SRC
** modalka
   :PROPERTIES:
   :CREATED:  [2019-06-28 Fri 16:56]
   :END:
*** setup
    #+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/modules/module-modalka.el
(use-package modalka
  :config
  (modalka-global-mode 1)

  (defun normal-mode-modalka ()
    (interactive)
    (if (modalka-mode nil)
        (modalka-mode 1)
      (nil)))

  (defun insert-mode-modalka ()
    (interactive)
    (modalka-mode 0))

  (setq-default cursor-type '(bar . 1))
  (setq modalka-cursor-type 'box)

  (setq org-capture-mode-hook 'insert-mode-modalka)

    #+END_SRC
