modules/module-modalka.el
(use-package modalka
  :config
  (modalka-global-mode 1)

  (defun normal-mode-modalka ()
    (interactive)
    (if (modalka-mode nil)
        (modalka-mode 1)
      (nil)))

  (defun insert-mode-modalka ()
    (interactive)
    (modalka-mode 0))

  (setq-default cursor-type '(bar . 1))
  (setq modalka-cursor-type 'box)

  (setq org-capture-mode-hook 'insert-mode-modalka)
