personal-config.org
** torus
   :PROPERTIES:
   :CREATED:  [2019-06-28 Fri 16:56]
   :END:
   #+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/modules/module-torus.el
(use-package torus
  :defer 0.1
  :bind-keymap ("C-x t" . torus-map)
  :bind (
         :map torus-map
         ("t" . torus-copy-to-circle))
  :hook ((emacs-startup . torus-start)
         (kill-emacs . torus-quit))
  :custom (
           (torus-binding-level 1)
           (torus-verbosity 1)
           (torus-dirname (concat user-emacs-directory (file-name-as-directory "torus")))
           (torus-load-on-startup t)
           (torus-save-on-exit t)
           (torus-autoread-file (concat torus-dirname "last.el"))
           (torus-autowrite-file torus-autoread-file)
           (torus-backup-number 5)
           (torus-history-maximum-elements 30)
           (torus-maximum-horizontal-split 3)
           (torus-maximum-vertical-split 4)
           (torus-display-tab-bar t)
           (torus-separator-torus-circle " >> ")
           (torus-separator-circle-location " > ")
           (torus-prefix-separator "/")
           (torus-join-separator " & "))
  :config
  (torus-init)
  (torus-install-default-bindings)
  (defun torus-read (filename)
    "Read main torus variables from FILENAME as Lisp code."
    (interactive
     (list
      (read-file-name
       "Torus file : "
       (file-name-as-directory torus-dirname))))
    (let*
        ((file-basename (file-name-nondirectory filename))
         (minus-len-ext (- (min (length torus-extension)
                                (length filename))))
         (buffer))
      (unless (equal (cl-subseq filename minus-len-ext) torus-extension)
        (setq filename (concat filename torus-extension)))
      (when (torus--update-input-history file-basename)
        (if (file-exists-p filename)
            (progn
              (setq buffer (find-file-noselect filename))
              (eval-buffer buffer)
              (kill-buffer buffer))
          (message "File %s does not exist." filename))))
    ;; Also saved in file
                                        ;(torus--update-meta)
                                        ;(torus--build-index)
                                        ;(torus--build-meta-index)
    (torus--jump))
  (setq torus-prefix-key (kbd "C-x t"))

  )

   #+END_SRC

** dumb-jump
   :PROPERTIES:
   :CREATED:  [2019-06-28 Fri 16:56]
   :END:
   #+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/modules/module-dumb-jump.el
(use-package dumb-jump)
   #+END_SRC

   #+results:

** desktop-environment
   :PROPERTIES:
   :CREATED:  [2019-06-28 Fri 16:56]
   :END:
   #+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/modules/module-desktop-environment.el
(use-package desktop-environment
  :config
  (setq desktop-environment-screenshot-partial-command "scrot -s screenshot.png")
  (setq desktop-environment-screenshot-directory "~/Pictures"))

   #+END_SRC
** json-mode
   :PROPERTIES:
   :CREATED:  [2019-06-28 Fri 16:56]
   :END:
   #+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/modules/module-json-mode.el
(use-package json-mode)
   #+END_SRC

   #+results:

** web-beautify
   :PROPERTIES:
   :CREATED:  [2019-06-28 Fri 16:56]
   :END:
   #+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/modules/module-web-beautify.el
(use-package web-beautify)
   #+END_SRC

   #+results:

** web-mode
   :PROPERTIES:
   :CREATED:  [2019-06-28 Fri 16:56]
   :END:
   #+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/modules/module-web-mode.el
(use-package web-mode)
   #+END_SRC

   #+results:

* Helpers
** org
   :PROPERTIES:
   :CREATED:  [2019-06-28 Fri 16:56]
   :END:
*** org-contrib-autoloads
    #+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/helpers/helper-org.el
(after "org-contrib-autoloads"
    #+END_SRC
*** org-id
    :PROPERTIES:
    :CREATED:  [2019-06-28 Fri 09:50]
    :END:
    :LOGBOOK:
    - CLOSING NOTE [2019-06-28 Fri 09:50]
    :END:
    #+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/helpers/helper-org.el
(defun my/org-add-ids-to-headlines-in-file ()
  "Add CUSTOM_ID properties to all headlines in the
      current file which do not already have one."
  (interactive)
  (org-map-entries (lambda () (my/org-custom-id-get (point) 'create))))

(defun my/org-custom-id-get (&optional pom create prefix)
  "Get the CUSTOM_ID property of the entry at point-or-marker POM.
      If POM is nil, refer to the entry at point. If the entry does
      not have an CUSTOM_ID, the function returns nil. However, when
      CREATE is non nil, create a CUSTOM_ID if none is present
      already. PREFIX will be passed through to `org-id-new'. In any
      case, the CUSTOM_ID of the entry is returned."
  (interactive)
  (org-with-point-at pom
    (let ((id (org-entry-get nil "EXPORT_FILE_NAME")))
      (cond
       ((and id (stringp id) (string-match "\\S-" id))
        id)
       (create
        (setq id (org-id-new (concat prefix "h")))
        (org-entry-put pom "EXPORT_FILENAME" id)
        (org-id-add-location id (buffer-file-name (buffer-base-buffer)))
        id)))))
    #+END_SRC
*** org-mode-hooks
    :PROPERTIES:
    :CREATED:  [2019-06-28 Fri 09:50]
    :END:
    :LOGBOOK:
    - CLOSING NOTE [2019-06-28 Fri 09:50]
    :END:
    #+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/helpers/helper-org.el
   (defun my-org-mode-hooks ()
     (visual-line-mode)
     (turn-on-auto-fill)
     (turn-on-flyspell)
     (outline-minor-mode))

  (defvar my-cpp-other-file-alist
    '(("\\.org\\'" (".org_archive"))
      ))

  (setq-default ff-other-file-alist 'my-cpp-other-file-alist)

  (defun my/insert-created-timestamp()
    "Insert a CREATED property using org-expiry.el for TODO entries"
    (org-entry-put nil "CREATED" (format-time-string "<%Y-%m-%d %a %H:%M>"))
    (org-expiry-insert-created)
    (org-back-to-heading)
    (org-end-of-line)
    (insert " "))

  (add-hook 'org-capture-before-finalize-hook 'my/insert-created-timestamp)
  (add-hook 'org-capture-prepare-finalize-hook 'org-id-store-link)


   #+END_SRC
