helpers/helper-org.el
(after "org-contrib-autoloads"

(defun my/org-add-ids-to-headlines-in-file ()
  "Add CUSTOM_ID properties to all headlines in the
      current file which do not already have one."
  (interactive)
  (org-map-entries (lambda () (my/org-custom-id-get (point) 'create))))

(defun my/org-custom-id-get (&optional pom create prefix)
  "Get the CUSTOM_ID property of the entry at point-or-marker POM.
      If POM is nil, refer to the entry at point. If the entry does
      not have an CUSTOM_ID, the function returns nil. However, when
      CREATE is non nil, create a CUSTOM_ID if none is present
      already. PREFIX will be passed through to `org-id-new'. In any
      case, the CUSTOM_ID of the entry is returned."
  (interactive)
  (org-with-point-at pom
    (let ((id (org-entry-get nil "EXPORT_FILE_NAME")))
      (cond
       ((and id (stringp id) (string-match "\\S-" id))
        id)
       (create
        (setq id (org-id-new (concat prefix "h")))
        (org-entry-put pom "EXPORT_FILENAME" id)
        (org-id-add-location id (buffer-file-name (buffer-base-buffer)))
        id)))))

   (defun my-org-mode-hooks ()
     (visual-line-mode)
     (turn-on-auto-fill)
     (turn-on-flyspell)
     (outline-minor-mode))

  (defvar my-cpp-other-file-alist
    '(("\\.org\\'" (".org_archive"))
      ))

  (setq-default ff-other-file-alist 'my-cpp-other-file-alist)

  (defun my/insert-created-timestamp()
    "Insert a CREATED property using org-expiry.el for TODO entries"
    (org-entry-put nil "CREATED" (format-time-string "<%Y-%m-%d %a %H:%M>"))
    (org-expiry-insert-created)
    (org-back-to-heading)
    (org-end-of-line)
    (insert " "))

  (add-hook 'org-capture-before-finalize-hook 'my/insert-created-timestamp)
  (add-hook 'org-capture-prepare-finalize-hook 'org-id-store-link)
