personal-config.org
*** org-babel
    :PROPERTIES:
    :CREATED:  [2019-06-19 Wed 17:53]
    :END:
#+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/activity/activity-org.el
  (setq org-confirm-babel-evaluate nil
        org-src-fontify-natively t
        org-src-tab-acts-natively t
        org-src-preserve-indentation t
        org-src-window-setup 'current-window)

  (setq org-modules '(org-habit
                      org-timer
                      org-collector))

  (org-babel-do-load-languages
   (quote org-babel-load-languages)
   (quote ((emacs-lisp . t)
           (scheme . t)
           (dot . t)
           (ditaa . t)
           (python . t)
           (gnuplot . t)
           (shell . t)
           (ledger . t)
           (org . t)
           (plantuml . t)
           (latex . t))))

  (defadvice org-babel-execute-src-block (around load-language nil activate)
    "Load language if needed"
    (let ((language (org-element-property :language (org-element-at-point))))
      (unless (cdr (assoc (intern language) org-babel-load-languages))
        (add-to-list 'org-babel-load-languages (cons (intern language) t))
        (org-babel-do-load-languages 'org-babel-load-languages org-babel-load-languages))
      ad-do-it))



  (defun bh/display-inline-images ()
    (condition-case nil
        (org-display-inline-images)
      (error nil)))

  (add-hook 'org-babel-after-execute-hook 'bh/display-inline-images 'append)



  (setq org-confirm-babel-evaluate nil)

  (setq org-babel-results-keyword "results")

  (setq org-ditaa-jar-path "~/.emacs.d/ditaa0_9/ditaa0_9.jar")


#+END_SRC
*** org-habit
    :PROPERTIES:
    :CREATED:  [2019-06-19 Wed 17:53]
    :END:
#+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/activity/activity-org.el
(require 'org-habit)

  (setq org-habit-show-habits-only-for-today t)
  (setq org-agenda-tags-column -100
        org-habit-graph-column 45
        org-habit-preceding-days 28
        org-agenda-start-with-log-mode nil)

  (setq org-habit-show-habits t)

#+END_SRC
