personal-config.org
*** org-directory
    :PROPERTIES:
    :CREATED:  [2019-06-19 Wed 17:53]
    :END:
#+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/activity/activity-org.el
  (setq org-agenda-directory "~/org/agenda/")
  (setq org-ref-directory "~/org/notes/")
  (setq org-meta-directory "~/org/meta/")

  (setq org-attach-directory "~/org/notes/data/")

  (setq org-file-inbox (concat org-agenda-directory      "inbox.org"))
  (setq org-file-journal (concat org-agenda-directory    "log.org"))
    (setq org-file-reference (concat org-ref-directory  "reference.org"))
  (setq org-file-calendar (concat org-agenda-directory   "calendar.org"))

 #+END_SRC
*** org-archive
    :PROPERTIES:
    :CREATED:  [2019-06-19 Wed 17:53]
    :END:
#+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/activity/activity-org.el
  (setq org-archive-mark-done nil)

  (setq org-archive-location "~/org/agenda/log.org::datetree/* Completed Tasks")



#+END_SRC
*** org-capture
    :PROPERTIES:
    :ID:       b0c2f0a6-9fc8-4745-9b77-00af7eeb7c7a
    :CREATED:  [2019-06-19 Wed 17:53]
    :END:
#+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/activity/activity-org.el
    (setq org-capture-templates
          (quote (
          ("a" "Appointment" entry (file+headline "~/org/agenda/calendar.org") (file "~/.emacs.d/templates/event.tmplt")  :clock-in t :clock-resume t)
          ("t" "Task" entry (file org-file-inbox) (file "~/.emacs.d/templates/todo.tmplt") :clock-in t :clock-resume t)
          ("n" "Note" entry (file org-file-inbox) (file "~/.emacs.d/templates/note.tmplt") :clock-in t :clock-resume t)
          ("j" "Journal" entry (file+datetree "~/org/agenda/log.org")  "** %^{Title}  :journal: \n\n %?" :clock-in t :clock-resume t)
          )))

 #+END_SRC
