personal-config.org
*** autoloads-end
#+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/activity/activity-org.el
)
#+END_SRC
** org-refiler
   :PROPERTIES:
   :CREATED:  [2019-06-28 Fri 09:51]
   :END:
   :LOGBOOK:
   - CLOSING NOTE [2019-06-28 Fri 09:51]
   :END:
*** hydra
#+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/activity/activity-org-refiler.el
  (use-package hydra
    :config
#+END_SRC
*** org-refile-directly
#+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/activity/activity-org-refiler.el
  (setq org-refile-use-outline-path 'file
        org-outline-path-complete-in-steps nil)

  (defun org-subtree-region ()
    "Return a list of the start and end of a subtree."
    (save-excursion
      (list (progn (org-back-to-heading) (point))
            (progn (org-end-of-subtree)  (point)))))

  (defvar org-refile-directly-show-after nil
    "When refiling directly (using the `org-refile-directly'
   function), show the destination buffer afterwards if this is set
   to `t', otherwise, just do everything in the background.")

  (defun org-refile-directly (file-dest)
    "Move the current subtree to the end of FILE-DEST.
   If SHOW-AFTER is non-nil, show the destination window,
   otherwise, this destination buffer is not shown."
    (interactive "fDestination: ")

    (defun dump-it (file contents)
      (find-file-other-window file-dest)
      (goto-char (point-max))
      (insert "\n" contents))

    (save-excursion
      (let* ((region (org-subtree-region))
             (contents (buffer-substring (first region) (second region))))
        (apply 'kill-region region)
        (if org-refile-directly-show-after
            (save-current-buffer (dump-it file-dest contents))
          (save-window-excursion (dump-it file-dest contents))))))

  #+END_SRC

*** org-boxes-workflow
#+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/activity/activity-org-refiler.el
  (defun org-boxes-workflow ()
    "Load the default tasks file and start our hydra on the first task shown."
    (interactive)
    (find-file org-default-inbox-file)
    (goto-char (point-min))
    (org-next-visible-heading 1)
    (org-agenda-process))

  #+END_SRC
*** org-refile-to
#+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/activity/activity-org-refiler.el
  (defun org-refile-to-incubate ()
    "Refile (move) the current Org subtree to `org-default-incubate-file'."
    (interactive)
    (org-todo "HOLD")
    (org-refile-directly org-default-incubate-file)
    (kill-line))

  (defun org-refile-to-waiting ()
    "Refile (move) the current Org subtree to `org-default-incubate-file'."
    (interactive)
    (org-todo "WAITING")

    (org-refile-directly org-default-waiting-file)
    (kill-line))

  (defun org-refile-to-calendar ()
    "Refile (move) the current Org subtree to `org-default-incubate-file'."
    (interactive)
    (org-todo "TODO")

    (org-refile-directly org-default-calendar-file)
    (kill-line))

  (defun org-refile-to-task ()
    "Refile (move) the current Org subtree to `org-default-tasks-file'."
    (interactive)
    (org-todo "TODO")

    (org-refile-directly org-default-tasks-file)
    (kill-line))

  (defun org-refile-to-projects-dir ()
    "Move the current subtree to a file in the `projects' directory."
    (interactive)
    (org-refile-subtree-to-file org-default-projects-dir))

  (defun org-refile-to-technical-dir ()
    "Move the current subtree to a file in the `technical' directory."
    (interactive)
    (org-refile-subtree-to-file org-default-technical-dir))

  (defun org-refile-to-personal-dir ()
    "Move the current subtree to a file in the `personal' directory."
    (interactive)
    (org-refile-subtree-to-file org-default-personal-dir))

  (defun org-refile-to-notes-dir ()
    "Move the current subtree to a file in the `zettelkasten' directory."
    (interactive)
    (org-refile-notes-to-file org-default-notes-dir))

  (defun org-refile-to-headline (file headline)
    (let ((pos (save-excursion
                 (find-file file)
                 (org-find-exact-headline-in-buffer headline))))
      (org-refile nil nil (list headline file nil pos))
      (switch-to-buffer (current-buffer))))

  (defun org-refile-to-process ()
    "Refile (move) the current Org subtree to `org-default-incubate-file'."
    (interactive)

    (org-refile-directly "~/org/notes/process.org")
    (kill-line)
    )

  (defun org-refile-to-cross-ref ()
    "Refile (move) the current Org subtree to `org-default-incubate-file'."
    (interactive)

    (org-refile-directly "~/org/notes/cross-reference.org")
    (kill-line))
  #+END_SRC

*** note-to
#+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/activity/activity-org-refiler.el
  (defun note-to-websites ()
    (interactive)
    (org-refile-to-headline org-file-reference "Websites"))

  (defun note-to-images ()
    (interactive)
    (org-refile-to-headline org-file-reference "Images"))

  (defun note-to-videos ()
    (interactive)
    (org-refile-to-headline org-file-reference "Videos"))

  (defun note-to-audio ()
    (interactive)
    (org-refile-to-headline org-file-reference "Audio"))

  (defun note-to-documents ()
    (interactive)
    (org-refile-to-headline org-file-reference "Documents"))

  (defun refile-to-tickler ()
    (interactive)
    (org-refile-to-headline org-file-calendar "Tickler"))

  (defun refile-to-calendar ()
    (interactive)
    (org-refile-to-headline org-file-calendar "Calendar"))

  (defun org-refile-to-delegate ()
    "Refile (move) the current Org subtree to `org-default-incubate-file'."
    (interactive)
    (org-todo "DELEGATE")

    (org-refile-directly org-default-delegate-file)
    (kill-line))

  #+END_SRC
*** org-refile-subtree-to-file
#+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/activity/activity-org-refiler.el
  (defun org-refile-subtree-to-file (dir)
    "Archive the org-mode subtree and create an entry in the
   directory folder specified by DIR. It attempts to move as many of
   the subtree's properties and other features to the new file."
    (interactive "DDestination: ")
    (let* ((props      (org-subtree-metadata))
           (head       (plist-get props :header))
           (body       (plist-get props :body))
           (tags       (plist-get props :tags))
           (properties (plist-get props :properties))
           (area       (plist-get props :region))
           (filename   (org-filename-from-title head))
           (filepath   (format "%s/%s.org" dir filename)))
      (apply #'delete-region area)
      (org-create-org-file filepath head body)))

  (defun org-create-org-file (filepath header body)
    "Create a new Org file by FILEPATH. The contents of the file is
   pre-populated with the HEADER, BODY and any associated TAGS."
    (find-file-other-window filepath)
    (org-set-file-property "TITLE" header t)
    (org-set-file-property "CATEGORY" "project")
  ;  (when tags
  ;    (org-set-file-property "FILETAGS" (s-join " " tags)))

    ;;  Insert any drawer properties as #+PROPERTY entries:
    (when properties
      (goto-char (point-min))
      (or (re-search-forward "^\s*_\s$" nil t) (point-max))
      (--map (insert (format "#+PROPERTY: %s %s\n" (first it) (second it))) properties))

    ;; My auto-insert often adds an initial headline for a subtree, and in this
    ;; case, I don't want that... Yeah, this isn't really globally applicable,
    ;; but it shouldn't cause a problem for others.
    (when (re-search-forward "^\\* [0-9]$" nil t)
      (replace-match ""))

    (delete-blank-lines)
    (goto-char (point-max))
    (insert "\n")
    (insert "\n")
    (insert "* TODO " header)
    (insert "\n")
    (insert body))
  #+END_SRC
