personal-config.org
*** org-refile-notes-to-file
#+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/activity/activity-org-refiler.el
  (defun org-refile-notes-to-file (dir)
    "Archive the org-mode subtree and create an entry in the
    directory folder specified by DIR. It attempts to move as many of
    the subtree's properties and other features to the new file."
    (interactive "DDestination: ")
    (let* ((props      (org-subtree-metadata))
           (head       (plist-get props :header))
           (body       (plist-get props :body))
           (tags       (plist-get props :tags))
                                          ;          (properties (plist-get props :properties))
           (area       (plist-get props :region))
           (filename   (concat (format-time-string "%Y-%m-%dT%H.%M.%S")))
           (filepath   (format "%s/%s.org" dir filename)))
      (apply #'delete-region area)
      (org-create-notes-file filepath head body tags)))

  (defun org-create-notes-file (filepath header body tags)
    "Create a new Org file by FILEPATH. The contents of the file is
    pre-populated with the HEADER, BODY and any associated TAGS."
    (find-file filepath)
    (org-set-file-property "TITLE" header t)
    (org-set-file-property "DATE" (format-time-string "<%Y-%m-%d %H:%M>"))
    (org-set-file-property "KEYWORDS" (s-join "" tags))
    (goto-char (point-min))
    (when (re-search-forward "REFILE" nil t)
      (replace-match ""))

    (delete-blank-lines)
    (goto-char (point-max))
    (insert "\n\n")
                                          ;   (insert "* " header)
                                          ;   (insert "\n\n")
    (insert body)
    (goto-char (point-min))
    (save-buffer))
  #+END_SRC
*** org-rename-header
#+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/activity/activity-org-refiler.el
  (defun org-rename-header (label)
    "Rename the current section's header to LABEL, and moves the
    point to the end of the line."
    (interactive (list
                  (read-string "Header: "
                               (substring-no-properties (org-get-heading t t t t)))))
    (org-back-to-heading)
    (replace-string (org-get-heading t t t t) label))
  #+END_SRC
*** todays-journal-entry
#+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/activity/activity-org-refiler.el
  (defun todays-journal-entry ()
    "Return the full pathname to the day's journal entry file.
    Granted, this assumes each journal's file entry to be formatted
    with year/month/day, as in `20190104' for January 4th.

    Note: `org-journal-dir' variable must be set to the directory
    where all good journal entries live, e.g. ~/journal."
    (let* ((daily-name   (format-time-string "%Y-%m-%d"))
           (file-name    (concat org-journal-dir daily-name)))
      (expand-file-name file-name)))
  #+END_SRC
*** org-subtree-metadata helpers
#+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/activity/activity-org-refiler.el
(cl-defun unpackaged/org-refile-to-datetree (&key (date (calendar-current-date)) entry)
  "Refile ENTRY or current node to entry for DATE in datetree in FILE."
  (interactive)
  (require 'org-datetree)
  (setq file "~/org/agenda/log.org")
  (unless entry
    (org-cut-subtree))
  (condition-case err
      (with-current-buffer (or (org-find-base-buffer-visiting file)
                               (find-file-noselect file))
        (org-datetree-file-entry-under (or entry (car kill-ring)) date)
        (save-buffer))
    (error (unless entry
             (org-paste-subtree))
           (message "Unable to refile! %s" err))))


  (defun org-subtree-metadata ()
    "Return a list of key aspects of an org-subtree. Includes the
    following: header text, body contents, list of tags, region list
    of the start and end of the subtree."
    (save-excursion
      ;; Jump to the parent header if not already on a header
      (when (not (org-at-heading-p))
        (org-previous-visible-heading 1))

      (let* ((context (org-element-context))
             (attrs   (second context))
             (props   (org-entry-properties)))

        (list :region     (list (plist-get attrs :begin) (plist-get attrs :end))
              :header     (plist-get attrs :title)
              :tags       (org-get-subtree-tags props)
              :properties (org-get-subtree-properties attrs)
              :body       (org-get-subtree-content attrs)))))

  (defun org-get-subtree-tags (&optional props)
    "Given the properties, PROPS, from a call to
    `org-entry-properties', return a list of tags."
    (unless props
      (setq props (org-entry-properties)))
    (let ((tag-label (if org-get-subtree-tags-inherited "ALLTAGS" "TAGS")))
      (-some->> props
                (assoc tag-label)
                cdr
                substring-no-properties
                (s-split ":")
                (--filter (not (equalp "" it))))))

  (defvar org-get-subtree-tags-inherited t
    "Returns a subtree's tags, and all tags inherited (from tags
      specified in parents headlines or on the file itself). Defaults
      to true.")

  (defun org-get-subtree-properties (attributes)
    "Return a list of tuples of a subtrees properties where the keys are strings."

    (defun symbol-upcase? (sym)
      (let ((case-fold-search nil))
        (string-match-p "^:[A-Z]+$" (symbol-name sym))))

    (defun convert-tuple (tup)
      (let ((key (first tup))
            (val (second tup)))
        (list (substring (symbol-name key) 1) val)))

    (->> attributes
         (-partition 2)                         ; Convert plist to list of tuples
         (--filter (symbol-upcase? (first it))) ; Remove lowercase tuples
         (-map 'convert-tuple)))

  (defun org-get-subtree-content (attributes)
    "Return the contents of the current subtree as a string."
    (let ((header-components '(clock diary-sexp drawer headline inlinetask
                                     node-property planning property-drawer section)))

      (goto-char (plist-get attributes :contents-begin))

      ;; Walk down past the properties, etc.
      (while
          (let* ((cntx (org-element-context))
                 (elem (first cntx))
                 (props (second cntx)))
            (when (member elem header-components)
              (goto-char (plist-get props :end)))))

      ;; At this point, we are at the beginning of what we consider
      ;; the contents of the subtree, so we can return part of the buffer:
      (buffer-substring-no-properties (point) (org-end-of-subtree))))

  (defun org-filename-from-title (title)
    "Creates a useful filename based on a header string, TITLE.
    For instance, given the string:    What's all this then?
         This function will return:    whats-all-this-then"
    (let* ((no-letters (rx (one-or-more (not alphanumeric))))
           (init-try (->> title
                          downcase
                          (replace-regexp-in-string "'" "")
                          (replace-regexp-in-string no-letters "-"))))
      (string-trim init-try "-+" "-+")))

  (defun org-set-file-property (key value &optional spot)
    "Make sure file contains a top-level, file-wide property.
    KEY is something like `TITLE' or `FILETAGS'. This function makes
    sure that the property contains the contents of VALUE, and if the
    file doesn't have the property, it is inserted at either SPOT, or
    if nil,the top of the file."
    (save-excursion
      (goto-char (point-min))
      (let ((case-fold-search t))
        (if (re-search-forward (format "^#\\+%s:\s*\\(.*\\)" key) nil t)
            (replace-match value nil nil nil 1)

          (cond
           ;; if SPOT is a number, go to it:
           ((numberp spot) (goto-char spot))
           ;; If SPOT is not given, jump to first blank line:
           ((null spot) (progn (goto-char (point-min))
                               (re-search-forward "^\s*$" nil t)))
           (t (goto-char (point-min))))

          (insert (format "#+%s: %s\n" (upcase key) value))))))


  #+END_SRC
*** end
#+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/activity/activity-org-refiler.el
)
  #+END_SRC

** org-journal
   :PROPERTIES:
   :CREATED:  [2019-06-28 Fri 09:51]
   :END:
   :LOGBOOK:
   - CLOSING NOTE [2019-06-28 Fri 09:51]
   :END:
*** org-journal-autoloads
#+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/activity/activity-org-journal.el
      (use-package org-journal
        :config
#+END_SRC
