personal-config.org
*** journal
  #+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/activity/activity-org-journal.el
      (setq journal-author "Alexander Soto")

      ;; This is the base folder where all your "books"
      ;; will be stored.
      (setq journal-base-dir "~/org/notes")


      ;; These are your "books" (folders), add as many as you like.
      ;; Note: "sub volumes" are acheivable with sub folders.
      (setq journal-books
            '("projects"
              "personal"))

      ;; Functions for journal
      (defun get-journal-file-today (book)
        "Return today's filename for a books journal file."
        (interactive (list (completing-read "Book: " journal-books) ))
        (cond

         ((string-match "personal" book)
          (expand-file-name
           (concat journal-base-dir book "/"
                   (format-time-string "%Y-%m-%dT%H.%M.%S") ".org.gpg" )))

         ((unless (equal book '("personal"))
            (expand-file-name
             (concat journal-base-dir book "/"
                     (format-time-string "%Y-%m-%dT%H.%M.%S") ".org" ))))))

      (defun journal-today ()
        "Load todays journal entry for book"
        (interactive)
        (auto-insert-mode)
        (find-file (call-interactively 'get-journal-file-today)) )

      (defun journal-entry-date ()
        "Inserts the journal heading based on the file's name."
        (when (string-match
               "\\(20[0-9][0-9]\\)\\([0-9][0-9]\\)\\([0-9][0-9]\\)\\(.org\\)"
               (buffer-name))
          (let ((year  (string-to-number (match-string 2 (buffer-name))))
                (month (string-to-number (match-string 3 (buffer-name))))
                (day   (string-to-number (match-string 4 (buffer-name))))
                (datim nil))
            (setq datim (encode-time 0 0 0 day month year))
            (format-time-string "%Y-%m-%d (%A)" datim))))

            (eval-after-load 'autoinsert
        '(define-auto-insert
           '("\\(20[0-9][0-9]\\)\\(-\\)\\([0-9][0-9]\\)\\(-\\)\\([0-9][0-9]\\)\\(-\\)\\([0-9][0-9][0-9][0-9][0-9][0-9]\\)\\(.*\\)" . "Journal Header")
           '("Short description: "
             "#+TITLE: "
             (read-string "Title: ") \n
             "#+DATE: " (format-time-string "<%Y-%m-%d %H:%M>") \n
             "#+KEYWORDS: "
             (read-string "Keyword: ") \n \n

             > _ \n \n \n \n \n
             "
      ---
      ,*Related:*


      ---
      ,*References:*
      "

             )))

   #+END_SRC
*** autoload-ends
#+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/activity/activity-org-journal.el
)
#+END_SRC

* Bindings
** general-autoloads
#+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/bindings/bindings.el
(after "general-autoloads"
#+END_SRC
** Global
#+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/bindings/bindings.el
(general-define-key
"C-x b"    #'ivy-switch-buffer-non-exwm
"<print>"  #'desktop-environment-screenshot
"C-4"      #'my/org-capture-appt
"C-1"      #'my/org-capture-task
"C-2"      #'my/org-capture-journal
"C-3"      #'my/org-capture-note
"s-p"      #'my/switch-to-last-buffer
"s-SPC"    #'exwm-jump-to-last-exwm
"s-<tab>"  #'ivy-switch-buffer-exwm
"s-f"      #'toggle-single-window
"s-,"      #'winner-undo
"s-."      #'winner-redo
"s-r"      #'exwm-reset
"s-w"      #'exwm-workspace-switch
"s-l"      #'windmove-right
"s-k"      #'windmove-left
"s-i"      #'windmove-up
"s-o"      #'windmove-down
"s-L"      #'buf-move-right
"s-K"      #'buf-move-left
"s-I"      #'buf-move-up
"s-O"      #'buf-move-down
"s-x"      #'exwm-input-toggle-keyboard)

#+END_SRC
** Modes
*** Org
#+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/bindings/bindings.el
    (after "org-contrib-autoloads"

      (general-def org-mode-map


      )


      (general-def org-agenda-mode-map
      "x"   'org-agenda-exit
      "'"   'org-agenda-set-restriction-lock-from-agenda
      "\\"   'org-agenda-remove-restriction-lock

      )
)

#+END_SRC
** Prefix
#+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/bindings/bindings.el
  (general-define-key
  :prefix "C-c"

  )

#+END_SRC
** Definer
  #+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/bindings/bindings.el
    (general-define-key
         :keymaps 'key-translation-map
         "ESC" (kbd "C-g"))

        (defconst my-leader "C-c")

        (general-create-definer my-leader-def
          :prefix my-leader)

    ;; Global
        (my-leader-def



          )

    ;; Modes
        (my-leader-def
          :keymaps 'org-mode-map

          )

   #+END_SRC

** Unbound
  #+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/bindings/bindings.el
    (general-unbind
      "C-x m"
      )
  #+END_SRC
** autoload-ends
#+BEGIN_SRC emacs-lisp :tangle ~/.personal.d/bindings/bindings.el
)
#+END_SRC
